Revit 2025 API
WallSweepType Enumeration
 Represents the possible types for methods affecting wall sweeps or reveals.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WallSweepType
Public Enumeration WallSweepType
public enum class WallSweepType
type WallSweepType
Members
Member name | Value | Description
Sweep | 0 |  Represents a wall sweep.
Reveal | 1 |  Represents a reveal.
See Also
Reference
Autodesk.Revit.DB Namespace